ErpTest/src/InformationRegisters/уатНормыРасходаГСМ/уатНормыРасходаГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатНормыРасходаГСМ</name>
  <comment>(уат)</comment>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>ЛинейнаяНорма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаЕздку</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаЗапуск</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаИзменениеСобственногоВеса</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаОперацию</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаОтопитель</name>
    <comment>Норма на отопитель</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаПростойСВклДвигателем</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаПростойСВклДвигателемПроцентомОтБазовой</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота1</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота2</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота3</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота4</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота5</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота6</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота7</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота8</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота9</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>СпециальнаяРабота10</name>
    <type>
      <types>CatalogRef.уатПараметрыВыработки</types>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу1</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу2</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу3</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу4</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу5</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу6</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу7</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу8</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу9</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаСпециальнуюРаботу10</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаНаТранспортнуюРаботу</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НормаСпециальнаяНаМоточас</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СезоннаяНадбавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>УчитыватьПростоиДляРасчетаНормыМоточасов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>ГСМ</name>
    <comment>ГСМ</comment>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>МодельТС</name>
    <comment>Модель ТС</comment>
    <type>
      <types>CatalogRef.ТранспортныеСредства</types>
      <types>CatalogRef.уатМоделиТС</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Enums/уатГруппыГСМ/уатГруппыГСМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>уатГруппыГСМ</name>
  <comment>(уат)</comment>
  <enumValues>
    <name>Топливо</name>
  </enumValues>
  <enumValues>
    <name>Масло</name>
  </enumValues>
  <enumValues>
    <name>Талон</name>
  </enumValues>
  <enumValues>
    <name>ПрисадкиИТехническиеЖидкости</name>
  </enumValues>
</mdclass:Enum>

ErpTest/src/InformationRegisters/уатНормыРасходаГСМ/Forms/ФормаСписка/Module.bsl
&НаКлиенте
Процедура УстановитьФильтр()
	Если ЗначениеЗаполнено(МодельТС) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "МодельТС", МодельТС,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "МодельТС",,,, Ложь);
	КонецЕсли;	
	Если ЗначениеЗаполнено(ГСМ) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГСМ", ГСМ,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "ГСМ",,,, Ложь);
	КонецЕсли;
	Если ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация", Организация,,,Истина);
	Иначе
		ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(Список.Отбор, "Организация",,,, Ложь);
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОтборМодельТСПриИзменении(Элемент)
	УстановитьФильтр();
КонецПроцедуры

&НаКлиенте
Процедура ОтборГСМНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;
	ДопПараметры = Новый Структура("ЗначениеГСМДоИзменения, ИмяПроцедурыОписаниеОповещения", ГСМ, "ОписаниеОповещенияВыбораГСМ");
	уатЗащищенныеФункцииКлиент.ВыбратьГСМ(ПредопределенноеЗначение("Перечисление.уатГруппыГСМ.Топливо"), ЭтаФорма, ДопПараметры);
КонецПроцедуры

// Подключаемый динамически обработчик оповещения
&НаКлиенте
Процедура ОписаниеОповещенияВыбораГСМ(Результат, ДопПараметры) Экспорт
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ГСМ = Результат;
КонецПроцедуры

&НаКлиенте
Процедура ОтборГСМПриИзменении(Элемент)
	УстановитьФильтр();
КонецПроцедуры

&НаКлиенте
Процедура ОтборОрганизацияПриИзменении(Элемент)
	УстановитьФильтр();
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемПриИзменении(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.НормаНаПростойСВклДвигателем) Тогда
		ТекСтрока.НормаНаПростойСВклДвигателемПроцентомОтБазовой = 0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура НормаНаПростойСВклДвигателемПроцентомОтБазовойПриИзменении(Элемент)
	ТекСтрока = Элементы.Список.ТекущиеДанные;
	Если ЗначениеЗаполнено(ТекСтрока.НормаНаПростойСВклДвигателемПроцентомОтБазовой) Тогда
		ТекСтрока.НормаНаПростойСВклДвигателем = 0;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//уатЗащищенныеФункцииСервер.уатРегистрФормаСпискаПриСозданииНаСервере(Отказ, СтандартнаяОбработка,ДопПараметрыОткрытие);
	Если Отказ тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//уатЗащищенныеФункцииКлиент.уатРегистрФормаСпискаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
КонецПроцедуры
